#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.cloudflare-dns-clusterapps.data.cloudflare_zone.zone: Reading...
module.cloudflare-dns-cluster.data.cloudflare_zone.zone: Reading...
module.cloudflare-dns-huna.data.cloudflare_zone.zone: Reading...
module.oci.random_password.k3s_token: Refreshing state... [id=none]
module.oci.data.cloudinit_config.init_vm_primary["k3smaster1"]: Reading...
module.oci.data.cloudinit_config.init_vm_primary["k3smaster1"]: Read complete after 0s [id=3997988532]
module.cloudflare-dns-clusterapps.data.cloudflare_zone.zone: Read complete after 0s [id=6723a5a83bf5ef5991798bd4dad71ae5]
module.cloudflare-dns-huna.data.cloudflare_zone.zone: Read complete after 0s [id=4ac04d4e2be540bc8f1b3fec61b03d8d]
module.cloudflare-dns-cluster.data.cloudflare_zone.zone: Read complete after 0s [id=6723a5a83bf5ef5991798bd4dad71ae5]
module.oci.oci_core_vcn.vcn: Refreshing state... [id=ocid1.vcn.oc1.eu-frankfurt-1.amaaaaaaxfrjjjqag632wgpg2v6fpgi7ikn5nrjenj4w4662myyfqgpuqr6q]
module.oci.oci_core_network_security_group.nsg: Refreshing state... [id=ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaa6jxw2anlnzdsrp3nu7tugcpzntvpmnv5ckjgrlvplh46dvrux2xq]
module.oci.oci_core_internet_gateway.internet_gateway: Refreshing state... [id=ocid1.internetgateway.oc1.eu-frankfurt-1.aaaaaaaabpnhzefxeqea3cc3bsfgc65lh4gnqobpvwapp3lskq4qge64fglq]
module.oci.oci_core_default_security_list.security_list: Refreshing state... [id=ocid1.securitylist.oc1.eu-frankfurt-1.aaaaaaaacr5qnp6mmt5awkmuws5ndvl372376byuiclpyey5cahq3sv2loxa]
module.oci.oci_core_subnet.k3s_subnet: Refreshing state... [id=ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaajvhgqktosqehgl2au4b4pjom2yphvgrdkt5e4dzifreyy7gno44q]
module.oci.oci_core_default_route_table.default_oci_core_default_route_table: Refreshing state... [id=ocid1.routetable.oc1.eu-frankfurt-1.aaaaaaaaogqyjbvjd7jmt5thygqtkub3btjccnxfxjbiqvduau4jxzg6u5sq]
module.oci.oci_core_network_security_group_security_rule.allow_http_from_all: Refreshing state... [id=60583F]
module.oci.oci_core_network_security_group_security_rule.allow_https_from_all: Refreshing state... [id=63BDAE]
module.oci.oci_core_network_security_group_security_rule.allow_kubeapi_from_all: Refreshing state... [id=1CCBDE]
module.oci.oci_core_instance.vm_primary["k3smaster1"]: Refreshing state... [id=ocid1.instance.oc1.eu-frankfurt-1.antheljrxfrjjjqcvej6o7anvrk4v5xvin6coh5uz3ur5umzc6uj574rwj5a]
module.cloudflare-dns-huna.cloudflare_record.record["0"]: Refreshing state... [id=cc35fe705129c9df8e30a493f82f1a70]
module.cloudflare-dns-clusterapps.cloudflare_record.record["0"]: Refreshing state... [id=65f588e0b99c7cf0c6b51d82bd5cf251]
module.ssh-extract-kubeconfig.time_sleep.wait_60_seconds: Refreshing state... [id=2023-07-07T22:36:11Z]
module.cloudflare-dns-cluster.cloudflare_record.record["0"]: Refreshing state... [id=f3f7bf59a815c5bfe423a4e14d32bd19]
module.cloudflare-dns-huna.cloudflare_record.record["1"]: Refreshing state... [id=9b5a7fc98d7bdaeb7fd83108e88b49c8]
module.ssh-extract-kubeconfig.ssh_sensitive_resource.cat: Refreshing state... [id=6032217313227570022]
module.kubeconfig-github-secret.github_actions_organization_secret.kubeconfig_secret: Refreshing state... [id=UAT_KUBECONFIG]
module.cluster-config.helm_release.prometheus-basic-auth-secret[0]: Refreshing state... [id=prometheus-basic-auth-secret]
module.cluster-config.helm_release.prometheus[0]: Refreshing state... [id=prometheus]
module.cluster-config.helm_release.jaeger-basic-auth-secret[0]: Refreshing state... [id=jaeger-basic-auth-secret]
module.cluster-config.helm_release.jaeger[0]: Refreshing state... [id=jaeger]
module.cluster-config.tls_private_key.issuer_key[0]: Refreshing state... [id=12e2e70da18cbd186c4664beb05f3b8d431ad924]
module.cluster-config.tls_private_key.trustanchor_key[0]: Refreshing state... [id=9594c3fb278c2556c2876dbc4e24be2c4db634d5]
module.cluster-config.helm_release.linkerd-crds[0]: Refreshing state... [id=linkerd-crds]
module.cluster-config.helm_release.newrelic[0]: Refreshing state... [id=newrelic]
module.cluster-config.tls_cert_request.issuer_req[0]: Refreshing state... [id=d95f1eeb42d334dc383ce2ed3de0e9575a2a1972]
module.cluster-config.tls_self_signed_cert.trustanchor_cert[0]: Refreshing state... [id=309942936809763763663892693074874047546]
module.cluster-config.tls_locally_signed_cert.issuer_cert[0]: Refreshing state... [id=277071077278184365404172971400071844497]
module.cluster-config.helm_release.linkerd-control-plane[0]: Refreshing state... [id=linkerd-control-plane]
module.cluster-config.helm_release.kubernetes-dashboard-basic-auth-secret[0]: Refreshing state... [id=kubernetes-dashboard-basic-auth-secret]
module.cluster-config.helm_release.ingress-nginx[0]: Refreshing state... [id=ingress-nginx]
module.cluster-config.helm_release.linkerd-basic-auth-secret[0]: Refreshing state... [id=linkerd-basic-auth-secret]
module.cluster-config.helm_release.kubernetes-dashboard[0]: Refreshing state... [id=kubernetes-dashboard]
module.cluster-config.helm_release.linkerd-viz[0]: Refreshing state... [id=linkerd-viz]
module.cluster-config.helm_release.cert-manager[0]: Refreshing state... [id=cert-manager]
module.cluster-config.kubernetes_cluster_role_binding.kubernetes-dashboard-cluster-admin-role-binding[0]: Refreshing state... [id=kubernetes-dashboard-cluster-admin-role-binding]
module.cluster-config.helm_release.letsencrypt-cluster-issuer[0]: Refreshing state... [id=cert-manager-issuers]
module.cluster-config.kubernetes_ingress_v1.linkerd-viz-ingress[0]: Refreshing state... [id=linkerd-viz/linkerd-viz]
module.cluster-config.helm_release.linkerd-jaeger[0]: Refreshing state... [id=linkerd-jaeger]
module.cluster-config.helm_release.gatekeeper[0]: Refreshing state... [id=gatekeeper]
module.cluster-config.helm_release.root-ca[0]: Refreshing state... [id=root-ca]
module.cluster-config.helm_release.root-ca-cert-manager-issuers[0]: Refreshing state... [id=root-ca-cert-manager-issuers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster-config.helm_release.trivy-operator[0] will be created
  + resource "helm_release" "trivy-operator" {
      + atomic                     = false
      + chart                      = "trivy-operator"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "trivy-operator"
      + namespace                  = "trivy-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aquasecurity.github.io/helm-charts/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 1500
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "0.18.3"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @alinflorin, Action: `pull_request`, Working Directory: `uat`, Workflow: `Terraform UAT`*